public class Test4 {
    public static void main(String args[]){
        int num1 = 9 ;
        int num2 = 11 ;
        //与
        System.out.println(num1&num2);
        //分析
        //      9:00000000 00000000 00000000 00001001
        //     11:00000000 00000000 00000000 00001011
        //'&'结果:00000000 00000000 00000000 00001001
        //故结果为9
        //或
        System.out.println(num1|num2);
        //分析
        //      9:00000000 00000000 00000000 00001001
        //     11:00000000 00000000 00000000 00001011
        //'|'结果:00000000 00000000 00000000 00001011
        //故结果为11
    }
}
